{"pages":[{"url":"contact","text":"Dr. Colin McLear Office: 1003 Oldfather Hall Office Hours: T/R 2-3 p.m. Email: mclear@unl.edu Email is the best way to reach me. I answer emails on weekdays, usually within 24 hrs. Students, please check your syllabus before emailing your question. If it is covered in the syllabus, I likely won't respond. If you would like a response, please adhere to these basic email etiquette guidelines: Remember to include your full name and course/section. Use a professional email address, such as your UNL email account, to send email, instead of an anonymous internet account. Include an informative subject line that summarizes the content of your email (e.g. \"Question about Assignment 3 for PHIL101 ″ instead of \"Question\"). Begin your email with an appropriate greeting (Dear/Hi/Hello [professor's name]). Keep the body of your email brief and to the point. If it's longer than a paragraph, consider arranging a meeting during office hours to discuss your issue instead. Are you emailing with a question a classmate could answer (about material missed when absent, for example)? If so, ask that classmate before contacting your professor. It's more efficient for everyone. Do not send personal/confidential information in an email; email is not secure. Keep your tone professional. Write in complete sentences and avoid text-speak. Note: If your email looks like this: \"hi prof r we doing anything important 2day? kthxbai!\" you are unlikely to receive a reply. End your email with a closing (Best/Thank you/Sincerely/etc.) and your first and last name. Remember to leave time to receive a response. Do not expect a reply over the weekend or at 3 am, for example. Learning to communicate professionally is a critical skill that will help you in your future job searches and careers. Now is a good time to start practicing!","tags":"pages","title":"Contact"},{"url":"phil232.colinmclear.net","text":"This is the homepage for PHIL 232 — History of Early Modern Philosophy This course offers an introductory survey of some of the key figures in early modern (17th—18th century) European philosophy. These may include: Descartes, Locke, Leibniz, Malebranche, Newton, and Hume. Our main focus will be on the enormously influential work of René Descartes, specifically his theories of mind and nature, as well as subsequent reactions, criticisms, and (partial) defenses of his views in the writings of other prominent philosophers. Major themes include the nature of mind and matter, the structure of scientific explanation, causation and necessity, free will, and the existence and nature of God. If you'd like to take a look at the syllabus you can find it here: HTML | PDF","tags":"pages","title":"Welcome!"},{"url":"paper-topics","text":"You are required to write a paper in two drafts. The second draft should reflect consideration of comments made on the initial version. Papers should range between 3-6 double spaced pages (750-1500 words). Some latitude is allowed here, but less than three pages is unlikely to be enough to answer any of questions raised below. Similarly, you shouldn't need more than six pages to answer the prompt satisfactorily. Please follow the formatting directions specified on the syllabus. I expect papers to be: Clear : Write in short and complete sentences. Where possible, sacrifice elegance in favor of clarity. Signpost heavily. Avoid needless generality. Arguments : Your paper should have a thesis for which it argues. Autobiographical reportage should be kept to a minimum. Present reasons for your position, and present counterarguments where relevant. Appropriately Sourced : To the extent that you consult secondary sources (you are free to do so but not required) you must document them in a bibliography. This means any sources you consulted, not just what you explicitly quote. I also expect you to make appropriate use of the primary sources relevant to your discussion (e.g. Descartes's Meditations , or Locke's Essay ). When referring to a figure's ideas, cite the relevant area of the text in which this idea is expressed or referred to. You can also take a look at the rubric I used for grading papers. I would like to see a paper proposal , consisting of (i) a thesis statement; (ii) a sketch of your argument, sent to me by email no later than Friday, March 16 th Please put \"phil 232 paper proposal\" in the subject line. The first draft of the paper is due via email on Friday, April 13 th by 5 pm . The second and final draft is due via email on Wednesday, May 2 nd by 5 pm. Paper topics Descartes's ‘ cogito ‘ argument aims at demonstrating at least the following two claims: (i) that the Meditator exists; (ii) the nature of the Mediator is that of a thinking thing. Is Descartes successful here? Why/Why not? You might discuss at least the ‘Lichtenburg' objection, and the ‘Substance Theory' proposal as outlined in the class notes. Descartes and Locke take opposing positions as to whether we can have scientific knowledge (demonstrative knowledge that is explanatory, systematic and secure) of the natural world. Explain their opposing positions. Are there reasons to favor one figure over the other? Explain Locke's criticisms of innate ideas and discuss the various replies to these criticisms by Leibniz. Are Leibniz's replies convincing, and if so why? Leibniz is highly critical of the prevailing theory of matter of his time. Explain his critical arguments. Are they convincing? If not then explain why. If they are, explain why, and discuss the structure of his idealist theory in the Monadology . Is his positive position convincing? Hume presents a trenchant critique of the scholastic conception of causation and necessary connection. Explain his critique. What is Hume's positive position on causation? What problems, if any, are there with Hume's positive position? Hume presents a critique of prevailing conceptions of personal identity. What is this critique? What is Hume's positive conception? What problems are there for this conception?","tags":"pages","title":"Paper Topics"},{"url":"resources","text":"Course Mechanics Signing up for a Disqus account Reading & Writing Philosophy Jim Pryor's guides to reading and writing philosophy Purdue Online Writing Lab A Guide to Philosophical Writing Writing a Thesis Statement Philosophy Paper Structure Philosophical Concepts & Background Critical Thinking Philosophical Terms & Methods Internet Encyclopedia of Philosophy Stanford Encyclopedia of Philosophy","tags":"pages","title":"Resources"},{"url":"schedule","text":"This schedule is tentative and open to revision. Always check the ‘Assignments' page for the most current information on the week's assignment. Week Date Topic 1 1/9 The scholastic background 1/11 No Class 2 1/16 Descartes's Discourse on Method 1/18 First Meditation : skepticism & science 3 1/23 Second Meditation : the cogito argument 1/25 Second and Third Meditations : the wax argument & truth rule 4 1/30 Third Meditation , continued: ideas 2/1 Third Meditation , continued: the two proofs of God 5 2/6 Fourth and Fifth Meditations : error & the ontological proof 2/8 Catch-up 6 2/13 the Cartesian Circle & the Sixth Meditation 2/15 Sixth Meditation , continued & Correspondence with Elisabeth 7 2/20 Catch-up & Mid-term review 2/22 No Class 8 2/27 Mid-term 3/1 TBA 9 3/6 Locke against innate ideas ( ECHU Bk I) 3/8 Leibniz on innate ideas ( New Essays , Preface) 10 3/13 Locke on primary & secondary qualities ( ECHU , II ) 3/15 Locke on essence ( ECHU , III .iii.11-20 (especially §§ 15-17)) 11 3/27 Locke on knowledge ( ECHU , IV ) 3/29 No class 12 4/3 Leibniz's critique of material substance ( New System ) 4/5 Leibniz's idealism (the Monadology ) 13 4/10 Hume on the mind ( Enquiry , §§1-3, 12) 4/12 TBA 14 4/17 Hume on causation ( Enquiry , §§4-7) 4/19 Hume on personal identity ( Treatise , I.vi & appendix); Papers due 4/27 15 4/24 Last class; Review for final 4/26 Final exam","tags":"pages","title":"Schedule"},{"url":"week6-world.html","text":"This week we wrap up our discussion of the Meditations with Descartes's famous arguments for the difference between mental and material substance, as well as his proof of an external world. In-class notes are here . Class 7 (2/13) Fifth Meditations ; emphasis on the \"ontological proof\" at AT 7:64-70 Objections & Replies , \"Clear and Distinct Perception and the Cartesian Circle\", pp. 139-43 Hatfield, \" God and the circle \" Class 8 (2/15) Sixth Meditation Notes on the Sixth Meditation . Reading Questions What is the \"Cartesian Circle\"? What is a \"real\" distinction? What role does God play in Descartes's proof of the distinction between mind and body? Does Descartes think that God might deceive us about the existence of an external world? Why or why not?","tags":"assignments","title":"Week 6 - The World Regained"},{"url":"week5-ontotheism.html","text":"This week we discuss Descartes's account of error, his views on the relationship between essence and existence, his ontological proof for God's existnce, and the so-called \"Cartesian Circle\" that may well undermine his entire argumentative strategy in the Meditations . In-class notes are here . Class 6 (2/6) Fourth (emph on problem of error) and Fifth Meditations (emph on knowledge of essence) Notes on the Fourth and Fifth Meditations . Class 7 (2/8) Fifth Meditations ; emphasis on the \"ontological proof\" at AT 7:64-70 Objections & Replies , \"Clear and Distinct Perception and the Cartesian Circle\", pp. 139-43 Hatfield, \" God and the circle \" Reading Questions What is the basis of error? What is the essence of matter? Does knowledge of the essence of thing require its existence? What is the \"Cartesian Circle\"?","tags":"assignments","title":"Week 5 - Error & Essence"},{"url":"week4-ideas.html","text":"This week we discuss Descartes's conception of the vehicle and content of thought—viz. \"ideas\", as well as his proofs of the existence of God. Class 5 (1/30) Third Meditation , with special attention to pp. 88-95 ( AT 37-47) Class 6 (2/1) Third Meditation , with special attention to pp. 95-98 ( AT 47-52) Fourth and Fifth Meditations Notes on the Fourth and Fifth Meditations . In-class notes are here . Reading Questions What is the objective reality of an idea? What is the formal reality of an idea? What causal principle does Descartes appeal to with respect to ideas? Why does Descartes deny that the idea of God could come from experience? What is the basis of error? What is the essence of matter?","tags":"assignments","title":"Week 4 - Ideas & God"},{"url":"week3-god.html","text":"Class 5 Second Meditation , with special attention to the \"wax argument\" at pp. 84-6 (7:30-4). Class 6 Third Meditation McLear, Notes on the Third Meditation In-class notes are here . Reading Questions In the wax argument Descartes is aiming to show that what two claims are true? Aside from his existence what else does Descartes learn about himself as subject in the second Meditation ? What is the \"truth rule\"? What role do the proofs of God play in Descartes's overall argument in the Meditations ?","tags":"assignments","title":"Week 3 - God & Error"},{"url":"week2-doubt.html","text":"This week we look at Descartes's ambitions for constructing a scientific body of knowledge, his criticism of aristotelian empiricism, and his skeptical challenge. We then focus our discussion on Descartes's famous \" cogito \" argument in response to the skeptical challenges presented in the First Meditation . The in-class notes are here . Class 3 (1/16) Discussion of Discourse on the Method Descartes, Preface and Synopsis & First Meditation ( PDF ) McLear, Notes on the First Meditation Class 4 (1/18) Descartes, Second Meditation McLear, Notes on the Second Meditation Reading Questions While you read, think about how you might answer the following questions. We'll discuss these further in class. What does Descartes's foundationalist project in the Meditations have to do with scholastic conceptions of scientific knowledge? What is the basic problem, according to Descartes, with the traditional empiricism of scholastic Aristotelianism? What is Descartes's \"method of doubt\"?","tags":"assignments","title":"Week 2 - Descartes's Doubts"},{"url":"week1-scholasticism.html","text":"This week we'll look at the scholastic aristotelian background to the early modern period and get started with our reading of Descartes, focusing in particular on his conception of philosophical method. Class 1 (1/9) McLear, Notes on the Scholastic Background People & Dates No Class (1/11) We'll discuss the following next week: Descartes, Discourse on the Method Focus especially on part two McLear, Notes on Descartes's Method Reading Questions While you read, think about how you might answer the following questions. We'll discuss these further in class. How, if at all, do the explanatory ambitions of scholastic science differ from those of contemporary science? What is Descartes's proposed method for acquiring knowledge? What area of inquiry does Descartes's method seem most useful for? Could it be used in all areas equally well? A nice illustration of heliocentric vs. geocentric models of the orbits of the planets Here's a link to a useful online presentation of Euclid's Elements","tags":"assignments","title":"Week 1 - Descartes & his Scholastic Background"}]}